Revit 2027 API
ParameterTypeId.LeaderRightAttachment Property
 "Right Attachment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LeaderRightAttachment { get; }
Public Shared ReadOnly Property LeaderRightAttachment As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LeaderRightAttachment {
	ForgeTypeId^ get ();
}
static member LeaderRightAttachment : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace